app/controllers/reports_controller.rb

  def load_static_content
    @patient_count = Patient.count_by_sql("select count(distinct patients.id) from patients").to_i
    @male = Gender.find_by_code('M')
    @female = Gender.find_by_code('F')
    @tobacco_use_and_exposure = SocialHistoryType.find_by_name("Tobacco use and exposure")
---
SELECT * FROM "genders" WHERE ("genders"."code" = 'M') LIMIT 1
SELECT * FROM "social_history_types" WHERE ("social_history_types"."name" = 'Tobacco use and exposure') LIMIT 1